# 鶏の数を数えようという表示
print('鶏の数を数えよう:')

# めんどりの表示の後、計算結果を表示
print('めんどり', 25 + 30 / 6)
# おんどりの表示の後、計算結果を表示
print('おんどり', 100 - 25 * 3 % 4)

# 卵の数を数えようの表示
print('卵の数を数えよう:')

# 計算結果の表示。%は割った時の余りを示す。
print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6)

#「3+2<5-7は正しいか」の表示
print(' 3 + 2 < 5 - 7は正しいか？')

#実際に式をprintで表示させる。
#この時返ってくる数は、内容そのものではなく正しい、正しくないの表示。
print(3 + 2 < 5 - 7)

#「3+2は？」の表示に対し、その計算結果
print('3 + 2は？', 3 + 2)

#「5-7は？」の表示に対し、その計算結果
print('5 - 7は？', 5 - 7)

#計算結果が正しくないという文章の表示
print('なるほど、確かに正しくない(False)。')

#「もう少しやってみよう」の文章の表示
print('もう少しやってみよう。')

#「5>-2は？」の表示と、計算結果の表示
print('5 > -2は？', 5 > -2)

#「5>=-2は？」の表示と、正しい、正しくないの表示
print('5 >= -2は？',5 >= -2)
#「5<=-2は？」の表示と、正しい、正しくないの表示
print('5 <= -2は？', 5 <= -2)


#pythonを電卓として使用する
3+2
5*6
7%2
(11-2)%3
